In [1]:
import pandas as pd

In [2]:
countries_df = pd.read_csv("./data/countries.csv", index_col=0)
countries_df

   country      area     capital  population
KR   Korea     98480       Seoul    51780579
US     USA   9629091  Washington   331002825
JP   Japan    377835       Tokyo   125960000
CN   China   9596960     Beijing  1439323688
RU  Russia  17100000      Moscow   146748600

In [3]:
countries_df.head()

   country      area     capital  population
KR   Korea     98480       Seoul    51780579
US     USA   9629091  Washington   331002825
JP   Japan    377835       Tokyo   125960000
CN   China   9596960     Beijing  1439323688
RU  Russia  17100000      Moscow   146748600

In [4]:
countries_df[:3]

   country     area     capital  population
KR   Korea    98480       Seoul    51780579
US     USA  9629091  Washington   331002825
JP   Japan   377835       Tokyo   125960000

In [5]:
countries_df.loc['KR']

country          Korea
area             98480
capital          Seoul
population    51780579
Name: KR, dtype: object

In [6]:
countries_df['population'][:3]

KR     51780579
US    331002825
JP    125960000
Name: population, dtype: int64

In [7]:
countries_df.loc['US', 'capital']

'Washington'

In [8]:
countries_df['capital'].loc['US']

'Washington'

In [9]:
countries_df = pd.read_csv("./data/countries.csv", index_col=0)
countries_df['density'] = countries_df['population'] / countries_df['area']
countries_df

   country      area     capital  population     density
KR   Korea     98480       Seoul    51780579  525.797918
US     USA   9629091  Washington   331002825   34.375293
JP   Japan    377835       Tokyo   125960000  333.373033
CN   China   9596960     Beijing  1439323688  149.977044
RU  Russia  17100000      Moscow   146748600    8.581789

In [10]:
import pandas as pd
weather = pd.read_csv("./data/weather.csv", index_col=0, encoding='cp949')
weather.describe()

              평균기온         최대풍속         평균풍속
count  3653.000000  3649.000000  3647.000000
mean     12.942102     7.911099     3.936441
std       8.538507     3.029862     1.888473
min      -9.000000     2.000000     0.200000
25%       5.400000     5.700000     2.500000
50%      13.800000     7.600000     3.600000
75%      20.100000     9.700000     5.000000
max      31.300000    26.000000    14.900000

In [11]:
weather[['최대풍속','평균풍속']].count()

최대풍속    3649
평균풍속    3647
dtype: int64

In [12]:
weather[['최대풍속','평균풍속']].mean()

최대풍속    7.911099
평균풍속    3.936441
dtype: float64

In [13]:
weather.mean()[['최대풍속','평균풍속']]

최대풍속    7.911099
평균풍속    3.936441
dtype: float64

In [14]:
# end